sharad-patil24/connectedhomeip/src/platform/EFR32/RS911x/BLEManagerImpl.cpp
/*
 *
 *    Copyright (c) 2020-2021 Project CHIP Authors
 *    Copyright (c) 2019 Nest Labs, Inc.
 *
 *    Licensed under the Apache License, Version 2.0 (the "License");
 *    you may not use this file except in compliance with the License.
 *    You may obtain a copy of the License at
 *
 *        http://www.apache.org/licenses/LICENSE-2.0
 *
 *    Unless required by applicable law or agreed to in writing, software
 *    distributed under the License is distributed on an "AS IS" BASIS,
 *    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *    See the License for the specific language governing permissions and
 *    limitations under the License.
 */

/**
 *    @file
 *          Provides an implementation of the BLEManager singleton object
 *          for the Silicon Labs EFR32 platforms.
 */

/* this file behaves like a config.h, comes first */
#include <platform/internal/CHIPDeviceLayerInternal.h>
#if CHIP_DEVICE_CONFIG_ENABLE_CHIPOBLE

#include "sl_component_catalog.h"

#include <platform/internal/BLEManager.h>

#include "FreeRTOS.h"
#include "rail.h"
#include "rsi_driver.h"
#include "sl_bt_api.h"
#include "sl_bt_stack_config.h"
#include "sl_bt_stack_init.h"
#include "timers.h"

// Error include files
#include "rsi_error.h"

#ifdef RSI_WITH_OS
// OS include file to refer OS specific functionality
#include "rsi_os.h"
#endif
#ifdef RSI_M4_INTERFACE
#include "rsi_board.h"
#endif

// BLE Specific inclusions
#include <ble/CHIPBleServiceData.h>
#include <lib/support/CodeUtils.h>
#include <lib/support/logging/CHIPLogging.h>
#include <platform/CommissionableDataProvider.h>
#include <platform/DeviceInstanceInfoProvider.h>
#include <platform/EFR32/freertos_bluetooth.h>
#include <rsi_ble_apis.h>
#include <rsi_ble_config.h>

#if CHIP_ENABLE_ADDITIONAL_DATA_ADVERTISING
#include <setup_payload/AdditionalDataPayloadGenerator.h>
#endif

// Memory length for driver
#define GLOBAL_BUFF_LEN 15000

#ifdef RSI_WITH_OS
#define RSI_APPLICATION_TASK_PRIORITY 1
#define RSI_BLE_TASK_PRIORITY 2
#define RSI_DRIVER_TASK_PRIORITY 3

#define RSI_APPLICATION_TASK_STACK_SIZE 1000
#define RSI_BLE_TASK_STACK_SIZE 1000
#define RSI_DRIVER_TASK_STACK_SIZE 2000
#endif

// Wlan client mode
#define RSI_WLAN_CLIENT_MODE 0

// BTLE Coex mode
#define RSI_BTLE_MODE 13

// Parameter to run forever loop
#define RSI_FOREVER 1

// Memory to initialize driver
uint8_t global_buf[GLOBAL_BUFF_LEN];

uint8_t ble_connected;

using namespace ::chip;
using namespace ::chip::Ble;

namespace chip {
namespace DeviceLayer {
namespace Internal {

namespace {

#define CHIP_ADV_DATA_TYPE_FLAGS 0x01
#define CHIP_ADV_DATA_TYPE_UUID 0x03
#define CHIP_ADV_DATA_TYPE_NAME 0x09
#define CHIP_ADV_DATA_TYPE_SERVICE_DATA 0x16

#define CHIP_ADV_DATA_FLAGS 0x06

#define CHIP_ADV_DATA 0
#define CHIP_ADV_SCAN_RESPONSE_DATA 1
#define CHIP_ADV_SHORT_UUID_LEN 2

#define MAX_RESPONSE_DATA_LEN 31
#define MAX_ADV_DATA_LEN 31

// Timer Frequency used.
#define TIMER_CLK_FREQ ((uint32_t) 32768)
// Convert msec to timer ticks.
#define TIMER_MS_2_TIMERTICK(ms) ((TIMER_CLK_FREQ * ms) / 1000)
#define TIMER_S_2_TIMERTICK(s) (TIMER_CLK_FREQ * s)

#define BLE_MAX_BUFFER_SIZE (3076)
#define BLE_MAX_ADVERTISERS (1)
#define BLE_CONFIG_MAX_PERIODIC_ADVERTISING_SYNC (0)
#define BLE_CONFIG_MAX_SOFTWARE_TIMERS (4)
#define BLE_CONFIG_MIN_TX_POWER (-30)
#define BLE_CONFIG_MAX_TX_POWER (80)
#define BLE_CONFIG_RF_PATH_GAIN_TX (0)
#define BLE_CONFIG_RF_PATH_GAIN_RX (0)

// Default Connection  parameters
#define BLE_CONFIG_MIN_INTERVAL (16) // Time = Value x 1.25 ms = 30ms
#define BLE_CONFIG_MAX_INTERVAL (80) // Time = Value x 1.25 ms = 100ms
#define BLE_CONFIG_LATENCY (0)
#define BLE_CONFIG_TIMEOUT (100) // Time = Value x 10 ms = 1s
#define BLE_CONFIG_MIN_CE_LENGTH (0) // Leave to min value
#define BLE_CONFIG_MAX_CE_LENGTH (0xFFFF) // Leave to max value

TimerHandle_t sbleAdvTimeoutTimer; // FreeRTOS sw timer.

StackType_t bluetoothEventStack[CHIP_DEVICE_CONFIG_BLE_APP_TASK_STACK_SIZE / sizeof(StackType_t)];
StaticTask_t bluetoothEventTaskStruct;
static TaskHandle_t BluetoothEventTaskHandle;

const uint8_t UUID_CHIPoBLEService[]       = { 0xFB, 0x34, 0x9B, 0x5F, 0x80, 0x00, 0x00, 0x80,
                                         0x00, 0x10, 0x00, 0x00, 0xF6, 0xFF, 0x00, 0x00 };
const uint8_t ShortUUID_CHIPoBLEService[]  = { 0xF6, 0xFF };
const ChipBleUUID ChipUUID_CHIPoBLEChar_RX = { { 0x18, 0xEE, 0x2E, 0xF5, 0x26, 0x3D, 0x45, 0x59, 0x95, 0x9F, 0x4F, 0x9C, 0x42, 0x9F,
                                                 0x9D, 0x11 } };
const ChipBleUUID ChipUUID_CHIPoBLEChar_TX = { { 0x18, 0xEE, 0x2E, 0xF5, 0x26, 0x3D, 0x45, 0x59, 0x95, 0x9F, 0x4F, 0x9C, 0x42, 0x9F,
                                                 0x9D, 0x12 } };

} // namespace

BLEManagerImpl BLEManagerImpl::sInstance;

/***************************************************************************/
/**
 * Setup the bluetooth init function.
 *
 * @return none
 *
 * All bluetooth specific initialization
 * code should be here like rsi_bt_init(),
 * sl_bt_init_multiprotocol() and so on.
 ******************************************************************************/
extern "C" sl_status_t initialize_bluetooth()
{
#if !defined(SL_CATALOG_KERNEL_PRESENT)
    NVIC_ClearPendingIRQ(PendSV_IRQn);
    NVIC_EnableIRQ(PendSV_IRQn);
#endif
    sl_status_t err = rsi_ble_init();
    EFM_ASSERT(err == SL_STATUS_OK);

    return err;
}

/*==============================================*/
/**
 * @fn         rsi_ble_app_init_events
 * @brief      initializes the event parameter.
 * @param[in]  none.
 * @return     none.
 * @section description
 * This function is used during BLE initialization.
 */
static void rsi_ble_app_init_events()
{
    ble_app_event_map  = 0;
    ble_app_event_mask = 0xFFFFFFFF;
    ble_app_event_mask = ble_app_event_mask; // To suppress warning while compiling
    return;
}

/*==============================================*/
/**
 * @fn         rsi_ble_app_init
 * @brief      initialize the BLE module.
 * @param[in]  none
 * @return     none.
 * @section description
 * This function is used to initialize the BLE module
 */
void rsi_ble_configurator_init(void)
{
    uint8_t adv[31] = { 2, 1, 6 };

    //  initializing the application events map
    rsi_ble_app_init_events();

    rsi_ble_add_configurator_serv(); // adding simple BLE chat service

    // registering the GAP callback functions
    rsi_ble_gap_register_callbacks(NULL, rsi_ble_on_connect_event, rsi_ble_on_disconnect_event, NULL, NULL, NULL,
                                   rsi_ble_on_enhance_conn_status_event, NULL, NULL, NULL);

    // registering the GATT callback functions
    rsi_ble_gatt_register_callbacks(NULL, NULL, NULL, NULL, NULL, NULL, NULL, rsi_ble_on_gatt_write_event, NULL, NULL, NULL, NULL,
                                    NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL);

    rsi_ble_smp_register_callbacks(rsi_ble_on_smp_request, // registering the SMP call back functions
                                   rsi_ble_on_smp_response, rsi_ble_on_smp_passkey, rsi_ble_on_smp_failed,
                                   rsi_ble_on_encrypt_started, NULL, NULL, NULL, NULL, NULL, NULL);

    // Set local name
    rsi_bt_set_local_name((uint8_t *) RSI_BLE_APP_DEVICE_NAME);

    // prepare advertise data //local/device name
    adv[3] = strlen(RSI_BLE_APP_DEVICE_NAME) + 1;
    adv[4] = 9;
    strcpy((char *) &adv[5], RSI_BLE_APP_DEVICE_NAME);

    // set advertise data
    rsi_ble_set_advertise_data(adv, strlen(RSI_BLE_APP_DEVICE_NAME) + 5);

    // set device in advertising mode.
    rsi_ble_start_advertising();
}

CHIP_ERROR BLEManagerImpl::_Init()
{
    CHIP_ERROR err;
    sl_status_t ret;

    // Initialize the CHIP BleLayer.
    err = BleLayer::Init(this, this, &DeviceLayer::SystemLayer());
    SuccessOrExit(err);

    memset(mBleConnections, 0, sizeof(mBleConnections));
    memset(mIndConfId, kUnusedIndex, sizeof(mIndConfId));
    mServiceMode = ConnectivityManager::kCHIPoBLEServiceMode_Enabled;

    // Start Bluetooth Link Layer and stack tasks
    ret =
        bluetooth_start(CHIP_DEVICE_CONFIG_BLE_LL_TASK_PRIORITY, CHIP_DEVICE_CONFIG_BLE_STACK_TASK_PRIORITY, initialize_bluetooth);
    VerifyOrExit(ret == SL_STATUS_OK, err = MapBLEError(ret));

    rsi_ble_add_simple_chat_serv3();
    rsi_ble_register_callback()

        //  initializing the application events map
        rsi_ble_app_init_events();

// EFR
#if 0
    // Start Bluetooth Link Layer and stack tasks
    ret =
        bluetooth_start(CHIP_DEVICE_CONFIG_BLE_LL_TASK_PRIORITY, CHIP_DEVICE_CONFIG_BLE_STACK_TASK_PRIORITY, initialize_bluetooth);

    VerifyOrExit(ret == SL_STATUS_OK, err = MapBLEError(ret));
#endif
    // End EFR

    // Init BLE

    // Create the Bluetooth Application task
    BluetoothEventTaskHandle =
        xTaskCreateStatic(bluetoothStackEventHandler,               /* Function that implements the task. */
                          CHIP_DEVICE_CONFIG_BLE_APP_TASK_NAME,     /* Text name for the task. */
                          ArraySize(bluetoothEventStack),           /* Number of indexes in the xStack array. */
                          this,                                     /* Parameter passed into the task. */
                          CHIP_DEVICE_CONFIG_BLE_APP_TASK_PRIORITY, /* Priority at which the task is created. */
                          bluetoothEventStack,                      /* Pointer to task heap */
                          &bluetoothEventTaskStruct);               /* Variable that holds the task struct */

    // Create FreeRTOS sw timer for BLE timeouts and interval change.
    sbleAdvTimeoutTimer = xTimerCreate("BleAdvTimer",       // Just a text name, not used by the RTOS kernel
                                       1,                   // == default timer period (mS)
                                       false,               // no timer reload (==one-shot)
                                       (void *) this,       // init timer id = ble obj context
                                       BleAdvTimeoutHandler // timer callback handler
    );

